/******************************************************************************
* COPYRIGHT @ Reserved
*******************************************************************************
* File         : 
* Function     : 
* Statement    : 
* Creation Info：
******************************************************************************/
/******************************************************************************
* Modification: 
* Time        ：
* Modifier    ：
* Statement   ：
******************************************************************************/
/*
* 功    能:FIFO队列库
* 说    明: 工作原理如下：

  -----------
  |  pHead-----------------
  |         |             |
  |  pTail---------       |
  |         |     v       v
  |         |   -----   -----
  -----------    ---     ---
  -        -
  
    ---------             --------          --------
    | pHead-------------->| ptNext---------->| ptNext--------
    |       |             |      |          |      |      |
    |       |       ------- pPrev|<---------- pPrev|      |
    |       |       |     |      |          |      |      |
    | pTail-----    |     | ...  |    ----->| ...  |      |
    |-------|  |    v     |------|    |     |------|      v
    |  -----               |                 -----
    |   ---                |                  ---
    |    -                 |                   -
    ------------------------
* 创建信息：
******************************************************************************/
/******************************************************************************
* 修改历史: 
* 时间：
* 修改人：
* 修改说明：
*
******************************************************************************/

/******************************* 包含文件声明 *********************************/
#include "cpss_type.h"
#include "cpss_util_q_fifo_lib.h"

/******************************* 局部宏定义 ***********************************/

/******************************* 全局变量定义/初始化 **************************/

/******************************* 局部常数和类型定义 ***************************/

/******************************* 局部函数原型声明 *****************************/

/******************************* 函数实现 *************************************/

/*******************************************************************************
* 函数名称: cpss_util_q_fifo_init
* 功    能: 初始化FIFO队列库。
* 函数类型: 
* 参    数: 
* 参数名称            类型                     输入/输出         描述
* pstHead       CPSS_UTIL_Q_FIFO_HEAD_T *       IN               队列头
* 函数返回: 返回1或0.
* 说    明: 
*******************************************************************************/
INT32 cpss_util_q_fifo_init
(
 CPSS_UTIL_Q_FIFO_HEAD_T *pstHead
 )
{
    cpss_util_dl_list_init (pstHead);
    
    return (1);
}

/*******************************************************************************
* 函数名称: cpss_util_q_fifo_put
* 功    能: 该函数增加指定的节点到FIFO队列。
* 函数类型: 
* 参    数: 
* 参数名称            类型                   输入/输出         描述
* pstHead       CPSS_UTIL_Q_FIFO_HEAD_T *     IN              队列头
* pstNode       CPSS_UTIL_Q_FIFO_NODE_T *     IN              节点
* 函数返回: 无.
* 说    明: 
*******************************************************************************/
/****        
VOID cpss_util_q_fifo_put
(
 CPSS_UTIL_Q_FIFO_HEAD_T *pstHead,
 CPSS_UTIL_Q_FIFO_NODE_T *pstNode,
 INT32   lKey
 )
{
    if (lKey == UTIL_Q_FIFO_KEY_HEAD)
    {
        cpss_util_dl_list_insert (pstHead, (CPSS_UTIL_DL_NODE_T *) NULL, pstNode);
    }
    else
    {
        cpss_util_dl_list_insert (pstHead, pstHead->pstTail, pstNode);
    }
}
****/
/*******************************************************************************
* 函数名称: cpss_util_q_fifo_remove
* 功    能: 该函数删除FIFO队列中的的一个节点。
* 函数类型: 
* 参    数: 
* 参数名称            类型                 输入/输出           描述
* pstHead       CPSS_UTIL_Q_FIFO_HEAD_T *     IN              队列头
* pstNode       CPSS_UTIL_Q_FIFO_NODE_T *     IN              节点
* 
* 函数返回: 无.
* 说    明: 
*******************************************************************************/
/****
VOID cpss_util_q_fifo_remove
(
 CPSS_UTIL_Q_FIFO_HEAD_T *pHead,
 CPSS_UTIL_Q_FIFO_NODE_T *pNode
 )
{
    cpss_util_dl_list_remove (pHead, pNode);
}
****/
/*******************************************************************************
* 函数名称: cpss_util_q_fifo_get
* 功    能: 获得FIFO队列中的一个节点。
* 函数类型: 
* 参    数: 
* 参数名称            类型                 输入/输出         描述
* pstHead       CPSS_UTIL_Q_FIFO_HEAD_T *     IN              队列头
* 
* 函数返回: 该节点的指针.
* 说    明: 
*******************************************************************************/
/****
CPSS_UTIL_Q_FIFO_NODE_T * cpss_util_q_fifo_get
(
 CPSS_UTIL_Q_FIFO_HEAD_T *pstHead
 )
{
    return ((CPSS_UTIL_Q_FIFO_NODE_T *) cpss_util_dl_list_get (pstHead));
}
****/
