/******************************************************************************
* COPYRIGHT @ Reserved
*******************************************************************************
* File         : 
* Function     : 
* Statement    : 
* Creation Info：
******************************************************************************/
/******************************************************************************
* Modification: 
* Time        ：
* Modifier    ：
* Statement   ：
******************************************************************************/
#ifndef CPSS_COM_IRQ_H
#define CPSS_COM_IRQ_H

/********************************* 头文件包含 ********************************/
#include "cpss_public.h"

/******************************** 宏和常量定义 *******************************/
/*Irq分发相关宏定义*/
#define CPSS_COM_IRQ_DISP_MQ_NAME "CpssIrqDispMq"
#define CPSS_COM_IRQ_DISP_MQ_MSG_NUM 100
#define CPSS_COM_IRQ_DISP_MQ_MSG_LEN 1024
#define CPSS_DRV_IRQ_HEARD  10
/******************************** 类型定义 ***********************************/

/*IRQ单链表结构*/
typedef struct tagCPSS_COM_IRQ_REG
{
    UINT32   ulIrqNo;             /* 中断号 */
    UINT32   ulPdNo;              /* 纤程号 */
    struct tagCPSS_COM_IRQ_REG *pstNext;      
}CPSS_COM_IRQ_REG_T;

/******************************** 头文件保护结尾 *****************************/
#endif /* CPSS_COM_IRQ_H */
/******************************** 头文件结束 *********************************/

